#Затем идем циклом по строке, записываем символ в переменную (key) и пока обьект в границах от 0 до 9,
# то добавляем цифры к переменой (x)
#Затем в новую строку(s) через append дописываем Количество(x) * Букву(key)
#Еще как вариант можно накапливать все цифры в переменную строчного типа, пока не встретим букву. потом приводим эту строку к int
#Выводим

#Поиск чисел в строке через while
stroka = input('Введите строку : ')
spisok = []
Num = ''
value = ''

for i in range(len(stroka))

print(spisok)
